<!-- dflook/terraform-github-actions {"workspace":"default","backend":"c0d17e84942f889120f7d2ec77999338685e2574092f22605bb15bcc69b70c92","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #232 at https://github.com/dflook/terraform-github-actions/actions/runs/2810290674","plan_hash":"05403d9447c48930c098039ba84be6baa24eb1f071e6d8f26cd3b148b13111d3"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "PR127loWHB" -> (known after apply)
  ~ foreach = "KFQqFE8kSS" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #232](https://github.com/dflook/terraform-github-actions/actions/runs/2810290674)